# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты
# вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть


import random

q = int(input('Введите количество монет: '))

count_1 = count_2 = 0

for _ in range(q):
    coin = random.randint(0, 1)
    print(coin, end = " ")
    if coin == 0:
        count_1 += 1
    else:
        count_2 += 1

if count_1 < count_2:
    print(f'\nНаименьшее количество монет, которые нужно перевернуть  {count_1}')
else:
    print(f'Наименьшее количество монет, которые нужно перевернуть  {count_2}')