# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

val = int(input('Введите число N: '))

if val < 0:
    print('Вы ввели отрицательное число.')

n = res = 0

while 2 ** n <= val:
    res = 2 ** n
    if res <= val:
        print(res, end = " ")
        n += 1