# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai (можно использовать псевдогенерацию). 
# Последняя строка содержит число X.
# *Пример:*
# 5
# 7 -2 3 5 1
# 3
# 1

# n = int(input('Введите число элементов в массиве: '))
# a = map(int, input().split())
# x = int(input())
# print(sum(map(lambda z: int(z == x), a)))


import random

n = int(input('Введите число элементов массива: '))

a = [random.randint(0, 9) for i in range(n)]
print(a, end = " ")

x = int(input(f'\nВведите число X: '))

print(f'Количество {x} в массиве - {a.count(x)}')